## One hot Encoding - for single feature

In [12]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings

warnings.filterwarnings('ignore')
%matplotlib inline

In [3]:
df = pd.read_excel("D:\\CS50\\projects data set\\titanic_dataset\\titanic.xlsx", usecols=['Sex'])
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [4]:
pd.get_dummies(df, drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

# NEXT

In [5]:
df = pd.read_excel("D:\\CS50\\projects data set\\titanic_dataset\\titanic.xlsx", usecols=['Embarked'])
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [6]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [7]:
df.dropna(inplace= True)

In [8]:
pd.get_dummies(df, drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

# NEXT

In [9]:
df = pd.read_csv('D:\\CS50\\projects data set\\mercedes benz\\train.csv', usecols=['X1','X2','X3','X4','X5','X6'])
df.head()

  X1  X2 X3 X4 X5 X6
0  v  at  a  d  u  j
1  t  av  e  d  y  l
2  w   n  c  d  x  j
3  t   n  f  d  x  l
4  v   n  f  d  h  d

### X1 Feature

### 10 most frequent categories in X1

In [10]:
# we need to pick the index name of the top 10 frequent labels

top_10 = df.X1.value_counts().sort_values(ascending= False).head(10).index
top_10

Index(['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o'], dtype='object')

In [11]:
# with those names of labels as a new feature
# let us compare the x1 labels with it...... if the label matches with X1.... then fill 1 in the place


for categories in top_10:
    
    df[categories] = np.where(df['X1'] == categories, 1,0)
    
df.head()

  X1  X2 X3 X4 X5 X6  aa  s  b  l  v  r  i  a  c  o
0  v  at  a  d  u  j   0  0  0  0  1  0  0  0  0  0
1  t  av  e  d  y  l   0  0  0  0  0  0  0  0  0  0
2  w   n  c  d  x  j   0  0  0  0  0  0  0  0  0  0
3  t   n  f  d  x  l   0  0  0  0  0  0  0  0  0  0
4  v   n  f  d  h  d   0  0  0  0  1  0  0  0  0  0